using Политiи.Данныя;

namespace Политiи.Генерація
{
    public static class ГенераціяКарты
    {
        public static int[,] ГенераціяМѣстности(Карта карта)
        {
            int[,] картаМѣстности = new int[карта.Ширина, карта.Высота];

            Шумъ шумъ = new();

            for (int y = 0; y < карта.Высота; y++)
            {
                for (int x = 0; x < карта.Ширина; x++)
                {

                    float число = шумъ.МногократныйШумъ2Д(x / (float)карта.Ширина * 10, y / (float)карта.Высота * 10);

                    if (число < 0.1) картаМѣстности[x, y] = 0;
                    else if (число < 0.9) картаМѣстности[x, y] = 1;
                    else картаМѣстности[x, y] = 2;
                }
            }

            return картаМѣстности;
        }
    }
}
